Repository: jjhhyyg/WordScene
Catalog: WordScene/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, hi, id, it, ja, ko, nl, pl, pt, ru, tr, vi, zh_hant

source: 给重要收藏加星标后，可在这里快速筛选。
ar: قم بتعليم المفضلات المهمة بنجمة لتصفيتها هنا بسرعة.
de: Markieren Sie wichtige Favoriten mit einem Stern, um sie hier schnell zu filtern.
en: Star important saved items to filter them here quickly.
es: Marca guardados importantes con una estrella para filtrarlos rápidamente aquí.
fr: Ajoutez une étoile à vos favoris importants pour les retrouver ici.
hi: महत्वपूर्ण पसंदीदा को स्टार करके यहाँ तुरंत फ़िल्टर करें।
id: Beri bintang pada favorit penting untuk memfilter dengan cepat di sini.
it: Aggiungi stelle ai preferiti importanti per filtrarli qui.
ja: 重要な保存項目にスターを付けると、ここで素早くフィルタリングできます。
ko: 중요한 즐겨찾기에 별표를 표시하면 여기서 빠르게 필터링할 수 있습니다.
nl: Markeer belangrijke favorieten met een ster om ze hier snel te filteren.
pl: Oznacz ważne elementy gwiazdką, aby szybko je filtrować.
pt: Marque favoritos importantes com estrela para filtrar rapidamente aqui.
ru: Добавьте важные избранные в звёзды, чтобы быстро фильтровать их здесь.
tr: Önemli kayıtları yıldızlayarak buradan hızlıca filtreleyebilirsiniz.
vi: Đánh dấu sao cho mục yêu thích quan trọng để lọc nhanh tại đây.
zh_hant: 為重要收藏加星號後，可在此快速篩選。

source: 编辑收藏
ar: تعديل المفضلة
de: Favorit bearbeiten
en: Edit Saved Item
es: Editar guardado
fr: Modifier le favori
hi: पसंदीदा संपादित करें
id: Edit Favorit
it: Modifica preferito
ja: 保存項目を編集
ko: 즐겨찾기 편집
nl: Favoriet bewerken
pl: Edytuj zapisane
pt: Editar favorito
ru: Редактировать избранное
tr: Kaydı Düzenle
vi: Chỉnh sửa mục đã lưu
zh_hant: 編輯收藏

source: 繁体中文
ar: الصينية التقليدية
de: Traditionelles Chinesisch
en: Traditional Chinese
es: Chino tradicional
fr: chinois traditionnel
hi: पारंपरिक चीनी
id: Tionghoa Tradisional
it: Cinese tradizionale
ja: 繁体字中国語
ko: 번체 중국어
nl: Traditioneel Chinees
pl: chiński tradycyjny
pt: Chinês tradicional
ru: Традиционный китайский
tr: Geleneksel Çince
vi: Tiếng Trung phồn thể
zh_hant: 繁體中文

source: 网络不可用
ar: الشبكة غير متاحة
de: Netzwerk nicht verfügbar
en: Network Unavailable
es: Red no disponible
fr: Réseau indisponible
hi: नेटवर्क उपलब्ध नहीं
id: Jaringan tidak tersedia
it: Rete non disponibile
ja: ネットワーク利用不可
ko: 네트워크 사용 불가
nl: Netwerk niet beschikbaar
pl: Brak sieci
pt: Rede indisponível
ru: Сеть недоступна
tr: Ağ Yok
vi: Mạng không khả dụng
zh_hant: 網路不可用

source: 网络可用
ar: الشبكة متاحة
de: Netzwerk verfügbar
en: Network Available
es: Red disponible
fr: Réseau disponible
hi: नेटवर्क उपलब्ध
id: Jaringan tersedia
it: Rete disponibile
ja: ネットワーク利用可能
ko: 네트워크 사용 가능
nl: Netwerk beschikbaar
pl: Sieć dostępna
pt: Rede disponível
ru: Сеть доступна
tr: Ağ Var
vi: Mạng khả dụng
zh_hant: 網路可用

source: 网络可用于翻译请求和 iCloud 同步。本机数据仍会先写入本地存储。
ar: الشبكة متاحة لطلبات الترجمة ومزامنة iCloud. ستُكتب البيانات المحلية أولاً في التخزين المحلي.
de: Netzwerk für Übersetzungsanfragen und iCloud-Sync verfügbar. Lokale Daten werden weiterhin zuerst lokal gespeichert.
en: The network is available for translation requests and iCloud sync. Local data is still written to local storage first.
es: La red está disponible para solicitudes de traducción y sincronización con iCloud. Los datos locales se escriben primero en el almacenamiento local.
fr: Le réseau est disponible pour les requêtes de traduction et la synchronisation iCloud. Les données locales sont d'abord écrites en local.
hi: नेटवर्क अनुवाद अनुरोधों और iCloud सिंक के लिए उपलब्ध है। स्थानीय डेटा पहले स्थानीय स्टोरेज में लिखा जाएगा।
id: Jaringan tersedia untuk permintaan terjemahan dan sinkronisasi iCloud. Data lokal tetap ditulis ke penyimpanan lokal terlebih dahulu.
it: La rete è disponibile per richieste di traduzione e sincronizzazione iCloud. I dati locali vengono comunque salvati prima in locale.
ja: 翻訳リクエストとiCloud同期にネットワークが利用可能です。ローカルデータはまずローカルストレージに書き込まれます。
ko: 네트워크를 통해 번역 요청 및 iCloud 동기화가 가능합니다. 로컬 데이터는 먼저 로컬 저장소에 기록됩니다.
nl: Netwerk beschikbaar voor vertaalverzoeken en iCloud synchronisatie. Lokale gegevens worden eerst lokaal opgeslagen.
pl: Sieć dostępna dla tłumaczeń i synchronizacji iCloud. Dane lokalne są najpierw zapisywane lokalnie.
pt: Rede disponível para solicitações de tradução e sincronização do iCloud. Os dados locais ainda são salvos primeiro no armazenamento local.
ru: Сеть доступна для запросов перевода и синхронизации iCloud. Локальные данные сначала записываются в локальное хранилище.
tr: Ağ, çeviri istekleri ve iCloud senkronizasyonu için kullanılabilir. Yerel veriler önce cihaza kaydedilir.
vi: Mạng khả dụng cho yêu cầu dịch và đồng bộ iCloud. Dữ liệu cục bộ vẫn được ghi vào bộ nhớ cục bộ trước.
zh_hant: 網路可用於翻譯請求與 iCloud 同步。本機資料仍會先寫入本地儲存。

source: 网络状态检测中
ar: جارٍ التحقق من حالة الشبكة
de: Netzwerkstatus wird geprüft
en: Checking Network Status
es: Comprobando estado de red
fr: Vérification du réseau
hi: नेटवर्क स्थिति जाँच रहा है
id: Memeriksa status jaringan
it: Verifica stato rete in corso
ja: ネットワーク状態確認中
ko: 네트워크 상태 확인 중
nl: Netwerkstatus controleren
pl: Sprawdzanie sieci
pt: Verificando status da rede
ru: Проверка состояния сети
tr: Ağ Durumu Kontrol Ediliyor
vi: Đang kiểm tra trạng thái mạng
zh_hant: 網路狀態檢測中

source: 翻译
ar: ترجمة
de: Übersetzen
en: Translate
es: Traducir
fr: Traduire
hi: अनुवाद
id: Terjemahkan
it: Traduci
ja: 翻訳
ko: 번역
nl: Vertalen
pl: Tłumacz
pt: Traduzir
ru: Перевод
tr: Çevir
vi: Dịch
zh_hant: 翻譯

source: 翻译中
ar: جارٍ الترجمة
de: Übersetzung läuft
en: Translating
es: Traduciendo
fr: Traduction en cours
hi: अनुवाद हो रहा है
id: Menerjemahkan
it: Traduzione in corso
ja: 翻訳中
ko: 번역 중
nl: Bezig met vertalen
pl: Tłumaczenie w toku
pt: Traduzindo
ru: Перевод...
tr: Çevriliyor
vi: Đang dịch
zh_hant: 翻譯中

source: 翻译历史
ar: سجل الترجمة
de: Übersetzungsverlauf
en: History
es: Historial
fr: Historique des traductions
hi: अनुवाद इतिहास
id: Riwayat Terjemahan
it: Cronologia traduzioni
ja: 翻訳履歴
ko: 번역 기록
nl: Vertalingsgeschiedenis
pl: Historia tłumaczeń
pt: Histórico de tradução
ru: История переводов
tr: Çeviri Geçmişi
vi: Lịch sử dịch
zh_hant: 翻譯歷史

source: 翻译历史 %lld 条
ar: سجل الترجمة %lld عنصرًا
de: Übersetzungsverlauf %lld Einträge
en: %lld history items
es: %lld elementos del historial
fr: Historique des traductions : %lld
hi: अनुवाद इतिहास %lld आइटम
id: Riwayat Terjemahan %lld item
it: Cronologia traduzioni %lld elementi
ja: 翻訳履歴 %lld 件
ko: 번역 기록 %lld개
nl: Vertalingsgeschiedenis %lld items
pl: Historia tłumaczeń: %lld
pt: Histórico de tradução %lld itens
ru: История переводов: %lld
tr: Çeviri Geçmişi %lld öğe
vi: Lịch sử dịch %lld mục
zh_hant: 翻譯歷史 %lld 條

source: 翻译历史删除失败：%@
ar: فشل حذف عنصر من سجل الترجمة: %@
de: Löschen des Übersetzungsverlaufs fehlgeschlagen: %@
en: Failed to delete translation history item: %@
es: No se pudo eliminar el elemento del historial: %@
fr: Échec de la suppression de l'historique : %@
hi: अनुवाद इतिहास हटाने में विफल: %@
id: Gagal menghapus riwayat terjemahan: %@
it: Eliminazione cronologia fallita: %@
ja: 翻訳履歴削除失敗：%@
ko: 번역 기록 삭제 실패: %@
nl: Verwijderen vertalingsgeschiedenis mislukt: %@
pl: Nie udało się usunąć elementu historii: %@
pt: Falha ao excluir item do histórico: %@
ru: Ошибка удаления из истории переводов: %@
tr: Çeviri geçmişi silinemedi: %@
vi: Xóa lịch sử dịch thất bại: %@
zh_hant: 翻譯歷史刪除失敗：%@

source: 翻译历史清空失败：%@
ar: فشل مسح سجل الترجمة: %@
de: Leeren des Übersetzungsverlaufs fehlgeschlagen: %@
en: Failed to clear translation history: %@
es: No se pudo borrar el historial de traducción: %@
fr: Échec de l'effacement de l'historique : %@
hi: अनुवाद इतिहास साफ़ करने में विफल: %@
id: Gagal menghapus semua riwayat terjemahan: %@
it: Cancellazione cronologia fallita: %@
ja: 翻訳履歴全削除失敗：%@
ko: 번역 기록 전체 삭제 실패: %@
nl: Wissen vertalingsgeschiedenis mislukt: %@
pl: Nie udało się wyczyścić historii: %@
pt: Falha ao limpar histórico de tradução: %@
ru: Ошибка очистки истории переводов: %@
tr: Çeviri geçmişi temizlenemedi: %@
vi: Xóa toàn bộ lịch sử dịch thất bại: %@
zh_hant: 翻譯歷史清空失敗：%@

source: 翻译历史读取失败：%@
ar: فشل تحميل سجل الترجمة: %@
de: Übersetzungsverlauf konnte nicht geladen werden: %@
en: Failed to read translation history: %@
es: No se pudo leer el historial de traducción: %@
fr: Échec de lecture de l'historique des traductions : %@
hi: अनुवाद इतिहास पढ़ने में विफल: %@
id: Gagal membaca riwayat terjemahan: %@
it: Caricamento cronologia traduzioni fallito: %@
ja: 翻訳履歴の読み込みに失敗しました：%@
ko: 번역 기록 불러오기 실패: %@
nl: Vertalingsgeschiedenis laden mislukt: %@
pl: Błąd wczytywania historii tłumaczeń: %@
pt: Falha ao ler histórico de tradução: %@
ru: Ошибка загрузки истории переводов: %@
tr: Çeviri geçmişi yüklenemedi: %@
vi: Đọc lịch sử dịch thất bại: %@
zh_hant: 翻譯歷史讀取失敗：%@

source: 翻译后点收藏，或手动新增一条本机记忆。
ar: بعد الترجمة، احفظها في المفضلة أو أضف ذكرى جديدة يدويًا.
de: Nach der Übersetzung speichern oder manuell einen Eintrag hinzufügen.
en: Save an item after translating, or add a local memory item manually.
es: Guarda algo después de traducir o añade manualmente un recuerdo local.
fr: Après la traduction, appuyez sur Favoris ou ajoutez manuellement un souvenir local.
hi: अनुवाद के बाद पसंदीदा में जोड़ें, या मैन्युअल रूप से एक नई स्थानीय स्मृति जोड़ें।
id: Setelah menerjemahkan, tandai atau tambahkan memori lokal baru secara manual.
it: Dopo la traduzione, salva o aggiungi manualmente un nuovo ricordo.
ja: 翻訳後にお気に入りに追加するか、手動で新しいメモを追加してください。
ko: 번역 후 즐겨찾기에 추가하거나 수동으로 새 항목을 추가하세요.
nl: Sla na vertaling op in favorieten of voeg handmatig een nieuwe herinnering toe.
pl: Po tłumaczeniu dodaj do ulubionych lub ręcznie zapisz nową pamięć lokalną.
pt: Após traduzir, salve ou adicione manualmente uma memória local.
ru: После перевода добавьте в избранное или вручную создайте новую запись на устройстве.
tr: Çeviriden sonra kaydedin veya manuel olarak yeni bir yerel anı ekleyin.
vi: Sau khi dịch, nhấn để lưu hoặc thêm thủ công một bản ghi nhớ trên máy.
zh_hant: 翻譯後點收藏，或手動新增一條本機記憶。

source: 翻译失败
ar: فشلت الترجمة
de: Übersetzung fehlgeschlagen
en: Translation Failed
es: Error de traducción
fr: Échec de la traduction
hi: अनुवाद विफल
id: Terjemahan gagal
it: Traduzione fallita
ja: 翻訳失敗
ko: 번역 실패
nl: Vertaling mislukt
pl: Tłumaczenie nie powiodło się
pt: Tradução falhou
ru: Ошибка перевода
tr: Çeviri başarısız
vi: Dịch thất bại
zh_hant: 翻譯失敗

source: 翻译服务
ar: خدمة الترجمة
de: Übersetzungsdienst
en: Translation Service
es: Servicio de traducción
fr: Service de traduction
hi: अनुवाद सेवा
id: Layanan Terjemahan
it: Servizio di traduzione
ja: 翻訳サービス
ko: 번역 서비스
nl: Vertalingsservice
pl: Usługa tłumaczeniowa
pt: Serviço de tradução
ru: Сервис перевода
tr: Çeviri Hizmeti
vi: Dịch vụ dịch thuật
zh_hant: 翻譯服務

source: 翻译请求失败，请检查网络后重试。
ar: فشل طلب الترجمة، تحقق من الاتصال وحاول مرة أخرى.
de: Übersetzungsanfrage fehlgeschlagen. Bitte Netzwerk prüfen und erneut versuchen.
en: The translation request failed. Check your connection and try again.
es: La solicitud de traducción falló. Revisa la conexión e inténtalo de nuevo.
fr: Échec de la demande de traduction. Vérifiez votre connexion et réessayez.
hi: अनुवाद अनुरोध विफल, कृपया नेटवर्क जांचें और पुनः प्रयास करें।
id: Permintaan terjemahan gagal, periksa jaringan dan coba lagi.
it: Richiesta di traduzione fallita, controlla la connessione e riprova.
ja: 翻訳リクエストに失敗しました。ネットワークを確認してから再試行してください。
ko: 번역 요청 실패, 네트워크를 확인하고 다시 시도하세요.
nl: Vertaalverzoek mislukt, controleer je netwerk en probeer het opnieuw.
pl: Żądanie tłumaczenia nie powiodło się. Sprawdź połączenie sieciowe i spróbuj ponownie.
pt: Falha na solicitação de tradução. Verifique a rede e tente novamente.
ru: Ошибка запроса перевода. Проверьте подключение к сети и повторите попытку.
tr: Çeviri isteği başarısız oldu, lütfen ağ bağlantınızı kontrol edip tekrar deneyin.
vi: Yêu cầu dịch thất bại, vui lòng kiểm tra mạng và thử lại.
zh_hant: 翻譯請求失敗，請檢查網路後重試。

source: 自动检测
ar: كشف تلقائي
de: Automatisch erkennen
en: Auto Detect
es: Detección automática
fr: Détection automatique
hi: स्वचालित पहचान
id: Deteksi Otomatis
it: Rilevamento automatico
ja: 自動検出
ko: 자동 감지
nl: Automatisch detecteren
pl: Wykryj automatycznie
pt: Detecção automática
ru: Автоопределение
tr: Otomatik Algıla
vi: Tự động phát hiện
zh_hant: 自動偵測

source: 英文
ar: الإنجليزية
de: Englisch
en: English
es: Inglés
fr: Anglais
hi: अंग्रेज़ी
id: Inggris
it: Inglese
ja: 英語
ko: 영어
nl: Engels
pl: Angielski
pt: Inglês
ru: Английский
tr: İngilizce
vi: Tiếng Anh

source: 范围
ar: النطاق
de: Bereich
en: Scope
es: Alcance
fr: Portée
hi: सीमा
id: Rentang
it: Intervallo
ja: 範囲
ko: 범위
nl: Bereik
pl: Zakres
pt: Escopo
ru: Диапазон
tr: Kapsam
vi: Phạm vi
zh_hant: 範圍

source: 荷兰语
ar: الهولندية
de: Niederländisch
en: Dutch
es: Neerlandés
fr: néerlandais
hi: डच
id: Belanda
it: Olandese
ja: オランダ語
ko: 네덜란드어
nl: Nederlands
pl: niderlandzki
pt: Neerlandês
ru: Нидерландский
tr: Felemenkçe
vi: Tiếng Hà Lan
zh_hant: 荷蘭語

source: 葡萄牙语
ar: البرتغالية
de: Portugiesisch
en: Portuguese
es: Portugués
fr: portugais
hi: पुर्तगाली
id: Portugis
it: Portoghese
ja: ポルトガル語
ko: 포르투갈어
nl: Portugees
pl: portugalski
pt: Português
ru: Португальский
tr: Portekizce
vi: Tiếng Bồ Đào Nha
zh_hant: 葡萄牙語

source: 西班牙语
ar: الإسبانية
de: Spanisch
en: Spanish
es: Español
fr: Espagnol
hi: स्पेनिश
id: Spanyol
it: Spagnolo
ja: スペイン語
ko: 스페인어
nl: Spaans
pl: Hiszpański
pt: Espanhol
ru: Испанский
tr: İspanyolca
vi: Tiếng Tây Ban Nha
zh_hant: 西班牙語

source: 覆盖重复项
ar: استبدال المكرر
de: Duplikate überschreiben
en: Replace Duplicates
es: Reemplazar duplicados
fr: Remplacer les doublons
hi: डुप्लिकेट को बदलें
id: Timpa Duplikat
it: Sovrascrivi duplicati
ja: 重複を上書き
ko: 중복 항목 덮어쓰기
nl: Duplicaten overschrijven
pl: Zastąp duplikaty
pt: Substituir duplicatas
ru: Перезаписать дубликаты
tr: Yinelenenleri Değiştir
vi: Ghi đè mục trùng
zh_hant: 覆蓋重複項

source: 设置
ar: الإعدادات
de: Einstellungen
en: Settings
es: Ajustes
fr: Réglages
hi: सेटिंग्स
id: Pengaturan
it: Impostazioni
ja: 設定
ko: 설정
nl: Instellingen
pl: Ustawienia
pt: Configurações
ru: Настройки
tr: Ayarlar
vi: Cài đặt
zh_hant: 設定

source: 译文
ar: الترجمة
de: Übersetzung
en: Translation
es: Traducción
fr: Traduction
hi: अनुवाद
id: Terjemahan
it: Traduzione
ja: 翻訳文
ko: 번역문
nl: Vertaling
pl: Tłumaczenie
pt: Tradução
ru: Перевод
tr: Çeviri
vi: Bản dịch
zh_hant: 譯文

source: 译文，点击复制
ar: الترجمة، انقر للنسخ
de: Übersetzung, zum Kopieren tippen
en: Translation, tap to copy
es: Traducción, toca para copiar
fr: Traduction, appuyez pour copier
hi: अनुवाद, कॉपी करने के लिए टैप करें
id: Terjemahan, ketuk untuk menyalin
it: Traduzione, tocca per copiare
ja: 翻訳文、タップでコピー
ko: 번역문, 탭하여 복사
nl: Vertaling, tik om te kopiëren
pl: Tłumaczenie, kliknij, aby skopiować
pt: Tradução, toque para copiar
ru: Перевод, нажмите для копирования
tr: Çeviri, kopyalamak için tıklayın
vi: Bản dịch, nhấn để sao chép
zh_hant: 譯文，點擊複製

source: 译文已生成，但翻译历史保存失败：%@
ar: تم إنشاء الترجمة، لكن فشل حفظ سجل الترجمة: %@
de: Übersetzung erstellt, aber Verlauf konnte nicht gespeichert werden: %@
en: Translation was generated, but history could not be saved: %@
es: La traducción se generó, pero no se pudo guardar el historial: %@
fr: Traduction générée, mais échec de la sauvegarde de l'historique : %@
hi: अनुवाद तैयार है, लेकिन अनुवाद इतिहास सहेजने में विफल: %@
id: Terjemahan berhasil, tetapi riwayat gagal disimpan: %@
it: Traduzione completata, ma salvataggio cronologia fallito: %@
ja: 翻訳文は生成されましたが、翻訳履歴の保存に失敗しました：%@
ko: 번역 완료, 기록 저장 실패: %@
nl: Vertaling gegenereerd, maar geschiedenis opslaan mislukt: %@
pl: Tłumaczenie zostało wygenerowane, ale nie udało się zapisać historii: %@
pt: Tradução gerada, mas falha ao salvar histórico: %@
ru: Перевод выполнен, но не удалось сохранить историю: %@
tr: Çeviri oluşturuldu ancak geçmiş kaydedilemedi: %@
vi: Bản dịch đã được tạo, nhưng lưu lịch sử dịch thất bại: %@
zh_hant: 譯文已生成，但翻譯歷史儲存失敗：%@

source: 译笺
ar: الترجمة
de: Übersetzungen
en: Word Scene
es: Escena de Palabras
fr: Notes de traduction
hi: अनुवाद नोट्स
id: Catatan Terjemahan
it: Traduzioni
ja: 翻訳ノート
ko: 번역 노트
nl: Vertalingen
pl: Tłumacz
pt: Traduções
ru: Переводы
tr: Çeviri Notları
vi: Dịch văn
zh_hant: 譯箋

source: 详细错误
ar: خطأ مفصل
de: Detailfehler
en: Detailed Error
es: Error detallado
fr: Erreur détaillée
hi: विस्तृत त्रुटि
id: Kesalahan Detail
it: Errore dettagliato
ja: 詳細エラー
ko: 상세 오류
nl: Gedetailleerde fout
pl: Szczegóły błędu
pt: Erro detalhado
ru: Подробная ошибка
tr: Ayrıntılı Hata
vi: Lỗi chi tiết
zh_hant: 詳細錯誤

source: 语言
ar: اللغة
de: Sprache
en: Languages
es: Idiomas
fr: Langue
hi: भाषा
id: Bahasa
it: Lingua
ja: 言語
ko: 언어
nl: Taal
pl: Język
pt: Idioma
ru: Язык
tr: Dil
vi: Ngôn ngữ
zh_hant: 語言

source: 请先在设置中保存 DeepSeek API Token。
ar: يرجى حفظ رمز DeepSeek API Token في الإعدادات أولاً.
de: Bitte zuerst den DeepSeek API Token in den Einstellungen speichern.
en: Save your DeepSeek API token in Settings first.
es: Primero guarda tu token de API de DeepSeek en Ajustes.
fr: Veuillez d'abord enregistrer votre jeton API DeepSeek dans les réglages.
hi: कृपया पहले सेटिंग्स में DeepSeek API Token सहेजें।
id: Simpan Token API DeepSeek di Pengaturan terlebih dahulu.
it: Salva prima il Token API DeepSeek nelle Impostazioni.
ja: 設定でDeepSeek API Tokenを保存してください。
ko: 설정에서 DeepSeek API Token을 먼저 저장하세요.
nl: Sla eerst een DeepSeek API Token op in Instellingen.
pl: Najpierw zapisz token API DeepSeek w ustawieniach.
pt: Salve o Token da API DeepSeek nas Configurações primeiro.
ru: Сначала сохраните DeepSeek API Token в настройках.
tr: Lütfen önce Ayarlar'da DeepSeek API Token'ınızı kaydedin.
vi: Vui lòng lưu DeepSeek API Token trong Cài đặt trước.
zh_hant: 請先在設定中儲存 DeepSeek API Token。

source: 请输入需要翻译的文本。
ar: يرجى إدخال النص المراد ترجمته.
de: Bitte Text zur Übersetzung eingeben.
en: Enter text to translate.
es: Introduce el texto que quieres traducir.
fr: Veuillez saisir le texte à traduire.
hi: कृपया अनुवाद करने के लिए टेक्स्ट दर्ज करें।
id: Masukkan teks yang akan diterjemahkan.
it: Inserisci il testo da tradurre.
ja: 翻訳するテキストを入力してください。
ko: 번역할 텍스트를 입력하세요.
nl: Voer de te vertalen tekst in.
pl: Wprowadź tekst do przetłumaczenia.
pt: Insira o texto a ser traduzido.
ru: Введите текст для перевода.
tr: Lütfen çevrilecek metni girin.
vi: Vui lòng nhập văn bản cần dịch.
zh_hant: 請輸入需要翻譯的文字。

source: 请选择要导入的 JSON 文件。
ar: يرجى اختيار ملف JSON للاستيراد.
de: Bitte eine JSON-Datei zum Importieren auswählen.
en: Choose the JSON file to import.
es: Elige el archivo JSON que quieres importar.
fr: Veuillez sélectionner le fichier JSON à importer.
hi: कृपया आयात करने के लिए JSON फ़ाइल चुनें।
id: Pilih file JSON yang akan diimpor.
it: Seleziona il file JSON da importare.
ja: インポートするJSONファイルを選択してください。
ko: 가져올 JSON 파일을 선택하세요.
nl: Selecteer het te importeren JSON-bestand.
pl: Wybierz plik JSON do zaimportowania.
pt: Selecione o arquivo JSON para importar.
ru: Выберите JSON-файл для импорта.
tr: Lütfen içe aktarılacak JSON dosyasını seçin.
vi: Vui lòng chọn tệp JSON để nhập.
zh_hant: 請選擇要匯入的 JSON 檔案。

source: 读取系统凭据失败：%lld。
ar: فشل قراءة بيانات النظام: %lld.
de: Systemanmeldedaten konnten nicht gelesen werden: %lld.
en: Failed to read system credentials: %lld.
es: No se pudieron leer las credenciales del sistema: %lld.
fr: Échec de la lecture des informations d'identification système : %lld.
hi: सिस्टम क्रेडेंशियल पढ़ने में विफल: %lld।
id: Gagal membaca kredensial sistem: %lld.
it: Lettura credenziali di sistema fallita: %lld.
ja: システム認証情報の読み込みに失敗しました：%lld。
ko: 시스템 자격 증명 읽기 실패: %lld.
nl: Systeemreferenties lezen mislukt: %lld.
pl: Błąd odczytu danych systemowych: %lld.
pt: Falha ao ler credenciais do sistema: %lld.
ru: Ошибка чтения системных учетных данных: %lld.
tr: Sistem kimlik bilgileri okunamadı: %lld.
vi: Đọc thông tin xác thực hệ thống thất bại: %lld.
zh_hant: 讀取系統憑證失敗：%lld。

source: 越南语
ar: الفيتنامية
de: Vietnamesisch
en: Vietnamese
es: Vietnamita
fr: vietnamien
hi: वियतनामी
id: Vietnam
it: Vietnamita
ja: ベトナム語
ko: 베트남어
nl: Vietnamees
pl: wietnamski
pt: Vietnamita
ru: Вьетнамский
tr: Vietnamca
vi: Tiếng Việt
zh_hant: 越南語

source: 输入
ar: الإدخال
de: Eingabe
en: Input
es: Entrada
fr: Saisie
hi: इनपुट
id: Masukan
it: Input
ja: 入力
ko: 입력
nl: Invoer
pl: Wejście
pt: Entrada
ru: Ввод
tr: Giriş
vi: Nhập
zh_hant: 輸入

source: 输入字符数 %lld
ar: عدد الأحرف المدخلة %lld
de: Zeichenanzahl %lld
en: %lld input characters
es: %lld caracteres de entrada
fr: Nombre de caractères saisis %lld
hi: इनपुट वर्ण संख्या %lld
id: Jumlah karakter masukan %lld
it: Caratteri inseriti %lld
ja: 入力文字数 %lld
ko: 입력 문자 수 %lld
nl: Invoertekens %lld
pl: Liczba znaków wejściowych: %lld
pt: Caracteres inseridos: %lld
ru: Символов ввода: %lld
tr: Giriş karakter sayısı %lld
vi: Số ký tự nhập %lld
zh_hant: 輸入字元數 %lld

source: 输入要翻译的单词、短语或句子
ar: أدخل كلمة أو عبارة أو جملة للترجمة
de: Wort, Phrase oder Satz zur Übersetzung eingeben
en: Enter a word, phrase, or sentence to translate
es: Introduce una palabra, frase u oración para traducir
fr: Saisissez un mot, une phrase ou une expression à traduire
hi: अनुवाद करने के लिए शब्द, वाक्यांश या वाक्य दर्ज करें
id: Masukkan kata, frasa, atau kalimat yang akan diterjemahkan
it: Inserisci parola, frase o periodo da tradurre
ja: 翻訳する単語、フレーズ、または文を入力
ko: 번역할 단어, 구문 또는 문장 입력
nl: Voer een woord, zin of tekst in om te vertalen
pl: Wpisz słowo, frazę lub zdanie do przetłumaczenia
pt: Digite palavras, frases ou sentenças para traduzir
ru: Введите слово, фразу или предложение для перевода
tr: Çevrilecek kelime, ifade veya cümleyi girin
vi: Nhập từ, cụm từ hoặc câu cần dịch
zh_hant: 輸入要翻譯的單詞、片語或句子

source: 输入要翻译的文本
ar: أدخل النص للترجمة
de: Text zum Übersetzen eingeben
en: Enter text to translate
es: Introduce el texto para traducir
fr: Saisir le texte à traduire
hi: अनुवाद करने के लिए टेक्स्ट दर्ज करें
id: Masukkan teks untuk diterjemahkan
it: Inserisci il testo da tradurre
ja: 翻訳テキストを入力
ko: 번역 입력
nl: Voer tekst in om te vertalen
pl: Wprowadź tekst do tłumaczenia
pt: Digite o texto para traduzir
ru: Введите текст для перевода
tr: Çevirilecek metni girin
vi: Nhập văn bản cần dịch
zh_hant: 輸入要翻譯的文字
